tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Automate deployment, configuration, and upgrading
brew "ansible"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Command-line tool for DigitalOcean
brew "doctl"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# The Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Tool to report network interface bandwidth
brew "ifstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# LastPass command-line interface tool
brew "lastpass-cli"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Diagnose infrastructure problems with metrics, visualizations & alarms
brew "netdata", restart_service: true
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Python dependency management tool
brew "pipenv"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Digital clock in ncurses
brew "tty-clock"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# UNIX shell (command interpreter)
brew "zsh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
cask "alfred"
cask "authy"
cask "brave-browser-beta"
cask "docker"
cask "firefox-beta"
cask "font-mononoki-nerd-font-mono"
cask "iterm2-beta"
cask "java"
cask "keybase"
cask "mactex"
cask "minikube"
cask "rocket"
cask "signal"
cask "slack-beta"
cask "spotify"
cask "steam"
cask "vlc"
